## Plan Result (stg_apim_appgw)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_public_ip.app_gw[0]
  * module.app-gw.azurerm_role_assignment.identity
  * module.app-gw.azurerm_user_assigned_identity.identity




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = (known after apply)
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "cft-apim00-aat-agw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "hmcts-hub-prod-int"
      + tags                        = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + autoscale_configuration {
          + max_capacity = 2
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = [
              + "firewall-prod-int-palo-cftaat.uksouth.cloudapp.azure.com",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "cft-mtls-api-mgmt-appgw-address-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "cft-mtls-api-mgmt-appgw-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "cft-mtls-api-mgmt-appgw-probe"
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
            # (3 unchanged attributes hidden)
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPublicFrontendIp"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }
      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "appGwPrivateFrontendIp"
          + private_ip_address            = "10.11.8.216"
          + private_ip_address_allocation = "Static"
          + private_link_configuration_id = (known after apply)
          + subnet_id                     = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/hub-appgw"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "http"
          + port = 80
        }
      + frontend_port {
          + id   = (known after apply)
          + name = "https"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "gateway"
          + subnet_id = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/hub-appgw"
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-mtls-api-mgmt-appgw.aat.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-aat-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile"
            # (1 unchanged attribute hidden)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "cft-mtls-api-mgmt-appgw.aat.platform.hmcts.net"
          + id                                        = (known after apply)
          + interval                                  = 10
          + minimum_servers                           = 0
          + name                                      = "cft-mtls-api-mgmt-appgw-probe"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Http"
          + timeout                                   = 15
          + unhealthy_threshold                       = 3
        }

      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "cft-mtls-api-mgmt-appgw"
          + id                          = (known after apply)
          + name                        = "cft-mtls-api-mgmt-appgw"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "cft-mtls-api-mgmt-appgw-rewriterule"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "cft-mtls-api-mgmt-appgw-rewriterule"

          + rewrite_rule {
              + name          = "AddCustomHeadersRule"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-ARR-ClientCertThumbprint"
                  + header_value = "{var_client_certificate_fingerprint}"
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy (known after apply)

      + ssl_profile {
          + id                               = (known after apply)
          + name                             = "cft-mtls-api-mgmt-appgw-sslprofile"
          + trusted_client_certificate_names = [
              + "cft-mtls-api-mgmt-appgw-reform_scan_sscs_ca",
              + "cft-mtls-api-mgmt-appgw-liberata_ca",
              + "cft-mtls-api-mgmt-appgw-exela_ca",
            ]
          + verify_client_cert_issuer_dn     = true
        }

      + trusted_client_certificate {
          + data = (sensitive value)
          + id   = (known after apply)
          + name = "cft-mtls-api-mgmt-appgw-reform_scan_sscs_ca"
        }
      + trusted_client_certificate {
          + data = (sensitive value)
          + id   = (known after apply)
          + name = "cft-mtls-api-mgmt-appgw-liberata_ca"
        }
      + trusted_client_certificate {
          + data = (sensitive value)
          + id   = (known after apply)
          + name = "cft-mtls-api-mgmt-appgw-exela_ca"
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.1"
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "AppGw"
      + target_resource_id             = (known after apply)

      + enabled_log (known after apply)

      + log (known after apply)

      + metric (known after apply)
    }

  # module.app-gw.azurerm_public_ip.app_gw[0] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-apim-appgw-aat-pip"
      + resource_group_name     = "hmcts-hub-prod-int"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + zones                   = [
          + "1",
          + "2",
          + "3",
        ]
    }

  # module.app-gw.azurerm_role_assignment.identity will be created
  + resource "azurerm_role_assignment" "identity" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-platform-stg-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.app-gw.azurerm_user_assigned_identity.identity will be created
  + resource "azurerm_user_assigned_identity" "identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-apim-aat-agw"
      + principal_id        = (known after apply)
      + resource_group_name = "hmcts-hub-prod-int"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }
      + tenant_id           = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2220,"Program":"tfcmt","SHA1":"","Target":"stg_apim_appgw","Vars":{}} -->